README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-23 Sat 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ET's .org to .html pipeline</title>
<meta name="author" content="Ewan Townshend" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<div id='view-controls'><div id='toggle-mode'>&#9788;</div><div id='toggle-toc'>&#9776;</div></div>
</div>
<div id="content" class="content">
<h1 class="title">ET's .org to .html pipeline</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcd681d9">About this package</a></li>
<li><a href="#org4a514a8">How to use this package:</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcd681d9" class="outline-2">
<h2 id="orgcd681d9">About this package</h2>
<div class="outline-text-2" id="text-orgcd681d9">
<p>
The leading file (et-org-html.el) contains emacs-lisp source defining a pipeline for <a href="https://orgmode.org/manual/Exporting.html">exporting</a> .org files, or <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Publishing.html">publishing</a> .org projects, to HTML. The HTML generated by this pipeline is enriched, relative to the Org Mode defaults, and enables easy customization by users. This is achieved by:
</p>
<ol class="org-ol">
<li>Extending the default org-to-html export backend to include 'copy' links for source blocks annotated with <code>#+ATTR_HTML: :copy-button t</code></li>
<li>Inserting a table-of-content view toggle, and a light/dark mode toggle, governed by included scripts (et-org-html.js).</li>
<li>Extracting colors from user-specified themes, interpolating these values in a CSS template (et-org-to-html.css), and injecting the result into a <code>&lt;style&gt;</code> element.</li>
<li>Inserting optional, user-defined html headers, footers, and additional CSS styling, for a customized page look-and-feel.</li>
</ol>
</div>
</div>

<div id="outline-container-org4a514a8" class="outline-2">
<h2 id="org4a514a8">How to use this package:</h2>
<div class="outline-text-2" id="text-org4a514a8">
<ul class="org-ul">
<li>You first must download this package and add it to your emacs load path.</li>
<li>Then, this use-package snippet will get you started:</li>
</ul>
<div class='org-src-wrapper'>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">et-org-html</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ensure</span> nil <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">get from load path</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> (org-mode . et-org-html-mode)
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> et-org-html-theme-alist
        '((dark . tomorrow-night-eighties) (light . solo-jazz)))

  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> et-org-html-header-path
        <span style="color: var(--clr-string); background-color: var(--bg-string);">"/pick/your/own/path/header.html"</span>)

  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> et-org-html-footer-path
        <span style="color: var(--clr-string); background-color: var(--bg-string);">"/pick/your/own/path/footer.html"</span>)

  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> et-org-html-extra-css-path
        <span style="color: var(--clr-string); background-color: var(--bg-string);">"/pick/your/own/path/style.css"</span>))))
</pre>
</div><button class='copyBtn' name=btn_5aa2f15d69af48b7b6fa4e625525f962>copy</button>
<script type='text/javascript'>
var copyBtnbtn_5aa2f15d69af48b7b6fa4e625525f962=document.querySelector('button[name=btn_5aa2f15d69af48b7b6fa4e625525f962]');
copyBtnbtn_5aa2f15d69af48b7b6fa4e625525f962.addEventListener('click', function(event) {
copyTextToClipboard(`(use-package et-org-html\n  :ensure nil ; get from load path\n  :hook (org-mode . et-org-html-mode)\n  :config\n  (setq et-org-html-theme-alist\n        '((dark . tomorrow-night-eighties) (light . solo-jazz)))\n\n  (setq et-org-html-header-path\n        \"/pick/your/own/path/header.html\")\n\n  (setq et-org-html-footer-path\n        \"/pick/your/own/path/footer.html\")\n\n  (setq et-org-html-extra-css-path\n        \"/pick/your/own/path/style.css\"))))\n`);
});
</script>
</div>
<ul class="org-ul">
<li>After executing this, when you open an org file, et-org-html-mode will activate. Then, when org-export is triggered with either the <code>'html</code> or <code>'et-html</code> backends, et-org-html will process the outputs, injecting default formatting and styling, as well as your headers, footers, and additional CSS (if any are specified).</li>

<li>Note: in order for a code block to be copyable, the .org source file must contain the <code>#+ATTR_HTML: :copy-button t</code> tag, and the export backend must be <code>'et-html</code>. The latter can be achieved by invoking <code>M-x et-org-html-export-to-html</code>, to create a file in the current directory, or <code>M-x et-org-html-export-to-html-file</code> to interactively specify the filepath.</li>

<li>Finally, to use this package for <i>publishing</i> Org projects, in specifying the value of <code>org-publish-project-alist</code>, for a given project, specify <code>:publishing-function et-org-html-publish-to-html</code>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<script type="text/javascript">
<!--/*--><![CDATA[/*><!--*/
/*
;; et-org-html.js
;;==============================================================================
;; Copyright (C) 2024, Ewan Townshend

;; Author: Ewan Townshend
;; URL: TBD
;; Version: 1.0

;;==============================================================================
;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;; This file is not part of emacs.

;;==============================================================================
;; JS for html exported by et-org-html.el
 */

let cookie = document.cookie.split('; ').find(r => r.startsWith('theme-mode'))

let mode = cookie ? cookie.split('=')[1] : 'dark'; // Default

let toggleModeBtn = document.getElementById('toggle-mode');

setMode(mode);

function setMode(mode) {
  document.body.dataset.mode = mode;
  toggleModeBtn.innerHTML = (mode === 'light') ? '&#9789;' : '&#9788;';
  document.cookie = 'theme-mode=' + mode;
}

toggleModeBtn.addEventListener('click', () => {
  mode = document.body.dataset.mode === 'dark' ? 'light' : 'dark';
  setMode(mode);
})


let toggleTocBtn = document.getElementById('toggle-toc')
let toc = document.getElementById('table-of-contents')

if (toc) {
  toggleTocBtn.dataset.show = 'true';
  toggleTocBtn.addEventListener('click', () => {
    let showingToc = document.body.dataset.toc;
    document.body.dataset.toc = showingToc ? '' : 'true';
    toc.addEventListener('click', () => {
      if (document.body.dataset.toc) {
	document.body.dataset.toc = "";
      }
    })
  })
}

function copyTextToClipboard(text) {
  // Make invisible textarea
  var textArea = document.createElement("textarea");
  textArea.style.position = 'fixed';
  textArea.style.top = 0;
  textArea.style.left = 0;
  textArea.style.width = '2em';
  textArea.style.height = '2em';
  textArea.style.padding = 0;
  textArea.style.border = 'none';
  textArea.style.outline = 'none';
  textArea.style.boxShadow = 'none';
  textArea.style.background = 'transparent';

  // Copy contents into it
  textArea.value = text;

  // Try to copy from it to clipboard
  document.body.appendChild(textArea);
  textArea.focus();
  textArea.select();
  try {
    var success = document.execCommand('copy');
    console.log(success ? 'Copied text' : 'Could not copy text');
  } catch (err) {
    console.log('Error copying text');
  }

  // Remove invisible textarea
  document.body.removeChild(textArea);
}
/*]]>*/-->
</script>
</div>
</body>
</html>